app/controllers/carts_controller.rb

  def destroy
   @cart.delete if @cart.id == session[:cart_id]
---
DELETE FROM "carts" WHERE "carts"."id" = 1